/*
*********************************************************************************************************
*
*	模块名称 : 应用程序参数模块
*	文件名称 : param.c
*	版    本 : V1.0
*	说    明 : 读取和保存应用程序的参数
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2013-01-01 armfly  正式发布
*
*	Copyright (C), 2012-2013, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "param.h"
#include "conf.h"
#include "main.h"

PARAM_T g_tParam;

/* 将16KB 一个扇区的空间预留出来做为参数区 For MDK */
//const uint8_t para_flash_area[16*1024] __attribute__((at(ADDR_FLASH_SECTOR_3)));

/*
*********************************************************************************************************
*	函 数 名: LoadParam
*	功能说明: 将当前运行参数镜像到g_tParam
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void LoadParam(void)
{
	sys_time.test_sizeof_g_tParam = sizeof(g_tParam);
	g_tParam.ParamVer = PARAM_VER;
	g_tParam.protect = PRT_E2ROMParas;
	g_tParam.other = OtherElement;
	g_tParam.heat = Heat_Cool_Element;
}

/*
*********************************************************************************************************
*	函 数 名: SaveParam
*	功能说明: 刷新g_tParam镜像
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void SaveParam(void)
{
	LoadParam();
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
